#+TITLE: How to use Org mode to follow experiments
#+PROPERTY: header-args:sh :dir /tmp/experiment_org

**** DONE Training

Pro tip: the ~:exports both~ and ~:eval no-export~ option means than when exporting to another type of file, the sh command and its results will be exported without reruning it.

#+begin_src sh :exports both :eval no-export :results verbatim
  python3 train.py -m "model_A" -d "dataset_B" -e 5 -o /tmp/experiment_org/model_A.txt
#+end_src

#+RESULTS:
: Training Done ! (model_A, dataset_B, 5)

**** DONE Choose evaluation epoch

The following code reads the output of our training and prints the results

Pro tip: when you are in a table, ~[M-x org-sort]~ will sort the row based on your choice.

#+begin_src sh :exports both :eval no-export
  cat /tmp/experiment_org/model_A.txt | awk -F' ' '
      NR==1 {print "epoch, metric_1, metric_2"} 	
            {print     $2        $5        $8}
  '
#+end_src

#+RESULTS:
| epoch |            metric_1 |           metric_2 |
|     0 | 0.14922942050710397 |  5.292867440598993 |
|     1 | 0.14418623130675406 |  7.061251998018506 |
|     2 | -0.9088694762261723 | 4.5253386090646295 |
|     3 | -0.5653074858174697 | 4.5861206693919225 |
|     4 |  0.4071395063029456 |  6.964283658334697 |

**** DONE Eval

Pro tip: here you can see the ~:results verbatim~ option, without it Org will try to put the output into a table (as above).

#+begin_src sh :exports both :eval no-export :results verbatim
  python3 eval.py -m "model_A" -d "dataset_A" -e 3
#+end_src

#+RESULTS:
: Epoch 3, metric_1 = 0.6, metric_2 = 6.0

***** DONE Training

#+begin_src sh :exports both :eval no-export :results verbatim
  python3 train.py -m "model_B" -d "dataset_A" -e 50 -o /tmp/experiment_org/model_B.txt
#+end_src

#+RESULTS:
: Training Done ! (model_B, dataset_A, 50)

**** DONE Training

#+begin_src sh :results verbatim
  python3 train.py -m $MODEL -d $DATASET -e $EPOCH -o $OUTPUT
#+end_src

#+RESULTS:
: Training Done ! (model_A, dataset_A, 5)

If you use ~[M-x org-babel-expand-src-block]~ on the previous ~src~ block, you will see:

#+begin_src sh
  DATASET='dataset_A'
  EPOCH='5'
  MODEL='model_A'
  OUTPUT='/tmp/experiment_org/model_A.txt'
  python3 train.py -m $MODEL -d $DATASET -e $EPOCH -o $OUTPUT
#+end_src

**** DONE Choose evaluation epoch

You can see here that you don't need to change anything as the variables are already set. You just need to run the ~src~ block.

#+begin_src sh
  cat $OUTPUT | awk -F' ' '
      NR==1 {print "epoch, metric_1, metric_2"}
            {print     $2        $5        $8}
  '
#+end_src

#+RESULTS:
| epoch |             metric_1 |           metric_2 |
|     0 |   1.5431820776439804 |  5.960442804429601 |
|     1 | -0.07489080727528663 |  6.032151012480522 |
|     2 | -0.16030363016801086 |  6.176561294759547 |
|     3 |  -0.8741808177267164 |  5.068879137451657 |
|     4 |   0.6237838942129226 | 7.3241069219918815 |

**** DONE Eval
:PROPERTIES:
:header-args+: :var EPOCH=2
:END:

In this ~:PROPERTIES:~ drawer, I can rewrite the value of the ~EPOCH~ variable as it does not have the same meaning.

#+begin_src sh :exports both :eval no-export :results verbatim
  python3 eval.py -m $MODEL -d $DATASET -e $EPOCH
#+end_src

#+RESULTS:
: Epoch 2, metric_1 = 0.6, metric_2 = 6.0

***** DONE Training

#+begin_src sh :exports both :eval no-export :results verbatim
  python3 train.py -m $MODEL -d $DATASET -e $EPOCH -o $OUTPUT
#+end_src

#+RESULTS:
: Training Done ! (model_B, dataset_A, 5)

* The Golden Age

The idea is to use another functionality of Org Mode: ~noweb~. This feature allows to have a code block expands in another place.
It will be more clear with an example

Let's say you have some code defining a complex string:

#+NAME: complex_string
#+begin_src :noweb yes
  This message is used whenever there is something to print. This message is very long and repetitive. For more readability it is in its own code block
#+end_src

Then in another code we can use this code block by using the following syntax:

#+begin_src sh :noweb yes
  if true
  then
      echo <<complex_string>>
  else
      echo <<complex_string>>
  fi
#+end_src

#+RESULTS:
: This message is used whenever there is something to print. This message is very long and repetitive. For more readability it is in its own code block

If you expand the code block you will see that the ~<<complex_string>>~ is replace by the content of ~complex_string~.
We will use that to have a single point of truth and expand the code block to get the command to run.

**** DONE Training

#+begin_src sh :results verbatim
  <<Training_Gold>>
#+end_src

#+RESULTS:
: Training Done ! (model_A, dataset_A, 5)

If you use ~[M-x org-babel-expand-src-block]~ on the previous ~src~ block, you will see exactly like before:

#+begin_src sh
  DATASET='dataset_A'
  EPOCH='5'
  MODEL='model_A'
  OUTPUT='/tmp/experiment_org/model_A.txt'
  python3 train.py -m $MODEL -d $DATASET -e $EPOCH -o $OUTPUT
#+end_src

**** DONE Choose evaluation epoch

#+begin_src sh
  <<Epoch_Gold>>
#+end_src

#+RESULTS:
| epoch |            metric_1 |           metric_2 |
|     0 | -0.8083130579107521 |  5.390750406028559 |
|     1 | 0.39034054273778007 |  5.438207716663534 |
|     2 |  0.5503080624589775 |  5.731402866989175 |
|     3 |  0.5027926126744592 |  6.981319877304114 |
|     4 |   2.345117765023441 | 5.5458417822293615 |

**** DONE Eval
:PROPERTIES:
:header-args+: :var EPOCH=2
:END:

#+begin_src sh :exports both :eval no-export :results verbatim
  <<Eval_Gold>>
#+end_src

#+RESULTS:
: Epoch 2, metric_1 = 0.6, metric_2 = 6.0

***** DONE Training

#+begin_src sh :exports both :eval no-export :results verbatim
  <<Training_Gold>>
#+end_src

#+RESULTS:
: Training Done ! (model_B, dataset_A, 5)

**** DONE Training

#+CALL: expand(name="Training_Diamond")

#+RESULTS:
#+begin_src sh :results verbatim
  python3 train.py -m model_A -d dataset_A -e 5 -o /tmp/experiment_org/model_A.txt
#+end_src

#+RESULTS:
: Training Done ! (model_A, dataset_A, 5)

**** DONE Eval
:PROPERTIES:
:EPOCH:  2
:END:

#+CALL: expand(name="Eval_Diamond")

#+RESULTS:
#+begin_src sh :results verbatim
  python3 eval.py -m model_A -d dataset_A -e 2
#+end_src

#+RESULTS:
: Epoch 2, metric_1 = 0.6, metric_2 = 6.0

***** DONE Training

#+CALL: expand(name="Training_Diamond")

#+RESULTS:
#+begin_src sh :results verbatim
  python3 train.py -m model_B -d dataset_A -e 5 -o /tmp/experiment_org/model_B.txt
#+end_src

#+RESULTS:
: Training Done ! (model_B, dataset_A, 5)

